The number of sides in the circuit.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public int SideNum { get; }
  Visual Basic
Public ReadOnly Property SideNum As Integer
	Get
  Visual C++
public:
property int SideNum {
	int get ();
}
 See Also
  PlanCircuit Class
  Autodesk.Revit.DB Namespace